app/Controllers/Customers.php

SELECT *
FROM `customers`
---
    public function index()
    {
        $model = new CustomerModel();
        $data['customers'] = $model->findAll();

INSERT INTO `customers` (`full_name`, `email`) VALUES ('Aivie', 'aivie@mail.com')
---
    public function create()
    {
        helper(['form']);
        $model = new CustomerModel();

        $rules = [
            'full_name' => 'required',
            'email'     => 'required|valid_email'
        ];

        if (!$this->validate($rules)) {
            return view('customers/new', [
                'validation' => $this->validator
            ]);
        }

        $model->save([
            'full_name' => $this->request->getPost('full_name'),
            'email'     => $this->request->getPost('email'),
        ]);

SELECT *
FROM `customers`
WHERE `customers`.`id` = '6'
---
    public function edit($id)
    {
        helper(['form']);
        $model = new CustomerModel();
        $data['customer'] = $model->find($id);

UPDATE `customers` SET `full_name` = 'Aivie Zuniga', `email` = 'aivie@mail.com'
WHERE `customers`.`id` IN ('8')
---
    public function update($id)
    {
        helper(['form']);
        $model = new CustomerModel();

        $rules = [
            'full_name' => 'required',
            'email'     => 'required|valid_email'
        ];

        if (!$this->validate($rules)) {
            $data['customer'] = $model->find($id);
            $data['validation'] = $this->validator;
            return view('customers/edit', $data);
        }

        $model->update($id, [
            'full_name' => $this->request->getPost('full_name'),
            'email'     => $this->request->getPost('email'),
        ]);