app/Controllers/Users.php

    public function index()
    {
        $model = new UserModel();
        $data['users'] = $model->findAll();
---
SELECT *
FROM `users`

    public function create()
    {
        helper(['form']);
        $model = new UserModel();

        $rules = [
            'username'  => 'required|is_unique[users.username]',
            'full_name' => 'required'
        ];

        if (!$this->validate($rules)) {
            return view('users/new', [
                'validation' => $this->validator
            ]);
        }

        $model->save([
            'username'  => $this->request->getPost('username'),
            'full_name' => $this->request->getPost('full_name'),
        ]);
---
INSERT INTO `users` (`username`, `full_name`) VALUES ('r.kshn', 'Raina Quejada')